lessons = [
    {
        "title": 'Урок 1: Вводное видео (субсидированию в растениводстве)',
        "url": "https://drive.google.com/file/d/1nSzvSQE_MncxZHzkXct7wXZRSk5IE3Gf/view?usp=share_link",
        "description": f"Вводное видео\n\nГосударство оказывает фермерам поддержку в виде субсидий. Посмотри видео о том, что такое субсидии, кто их может получать и что для этого нужно сделать.\nДля тех, кто желает получить подробную информацию по всем мерам государственной поддержки с обратной связью от эксперта, доступен платный курс",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 2: Подготовка документов',
        "url": "https://drive.google.com/file/d/1MkUAUGI7I8GKJnJpSyOAUeVf2ss0rkEw/view?usp=share_link",
        "description": f"Подготовка документов\n\nПодготовка документов – неотъемлемая часть процесса подачи заявок на субсидии. Именно документы подтверждают основание для получения субсидии. Посмотри видео и узнай, какие основные требования предъявляются к документам.\nДокументоведение – это целая наука, поэтому на полном курсе данной теме отведен целый урок, где вы подробно узнаете все тонкости по подготовке пакета документов.",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 3: Оцифровка',
        "url": "https://drive.google.com/file/d/1-og30LAoG_ou3CQ8W_GKiBgHVQmlyM5w/view?usp=share_link",
        "description": f"Оцифровка\n\nДля получения субсидий по направлению растениеводства необходимо наличие земельных угодий, которые оцифрованы. Что нужно знать при оцифровке и угодий и создании севооборотов, посмотри в видео.\nЕсли ты желаешь на живом примере увидеть, как оцифровывается земельное угодье, получить обратную связь от эксперта по своему хозяйству, запишись на полный курс.",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 4: Расчет суммы',
        "url": "https://drive.google.com/file/d/1vnuYJy0FQVTKDWBFPGARFjx571tUyb5G/view?usp=share_link",
        "description": f"Расчет суммы\n\nСумма субсидий, которую может получить фермер, зависит от множества факторов. Часто бывает так, что фермер планирует одну сумму, а фактически получает другую.  Что влияет на сумму субсидий посмотри в видео.\nМатематические расчеты и формулы порой написаны очень сложно, на полном курсе мы рассказываем простым языком о сложном, ты с легкостью сможешь посчитать сколько субсидий может получить твоя организация, также ты получишь обратную связь от эксперта для этого пройди полный курс с сопровождением.",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 5: Подача заявки',
        "url": "https://drive.google.com/file/d/1ISS2uH5AnYXDuNB-X4D_DXG5g8_GUHOc/view?usp=share_link",
        "description": f"Подача заявки\n\nПодача заявки – легкий процесс, если вы знаете основные этапы и уже подготовили всю необходимую информацию. Остается только внести данные из документов в заявку и прикрепить необходимый пакет документов. Как это сделать правильно смотри в видео.\nНа полном курсе мы разбираем подробно каждое направление субсидирования (удобрения, семена, пестициды, ставка вознаграждения, инвестиционные субсидии и т.д) с учетом всех нюансов, которые могут появиться, также все обучающиеся получают обратную связь от эксперта по любому вопросу, который касается субсидирования, для этого пройди полный курс.",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 6: Заключительное видео',
        "url": "https://drive.google.com/file/d/12MrxGH6W_Gwm1TobilaSWOR-ilPc4Wr4/view?usp=share_link",
        "description": f"Заключительное видео\n\nВажно помнить, что субсидии – это не спасательный круг, а приятный кэшбэк или бонус для успешной компании. Посмотри видео о том, что влияет на успех в получении субсидий.\n«Кадры решают все!» - эта фраза актуальна в любое время, а квалифицированные кадры тем более. С помощью наших курсов вы повысите уровень ваших специалистов, что позволит выйти на новый уровень доходности. Выбери свой курс и повысь уровень своих знаний!",
        "course_type": "Курсы по субсидированию в растениводстве"
    },
    {
        "title": 'Урок 1: Вводное видео (бухгалтерскому учету в сельском хозяйстве)',
        "url": "https://drive.google.com/file/d/1lAB4wW3yxfyMdGHTzzSs8pELfG61PwEb/view?usp=share_link",
        "description": f"Вводное видео\n\nЧто необходимо знать о ведении бухгалтерского учета в сельском хозяйстве. Особенности учета в зависимости от вашей организационно-правовой формы предприятия.\n Обо всем этом и не только можно узнать на полном курсе «Бухгалтерский учет в сельском хозяйстве».",
        "course_type": "Курсы по бухгалтерскому учету в сельском хозяйстве"
    },
    {
        "title": 'Урок 2: Субсидии и налоги',
        "url": "https://drive.google.com/file/d/1x8NUaxYHGoNr6XOQ_f-iNFEol0suxgSo/view?usp=share_link",
        "description": f"Субсидии и налоги\n\nЧастый вопрос – облагаются ли налогом полученные субсидии? Посмотрите видео, чтобы у вас было понимание того, что делать с субсидиями после того, как вы их получили.\n На полном курсе «Бухгалтерский учет в сельском хозяйстве» вы узнаете всю подробную информацию о налогообложении субсидий.",
        "course_type": "Курсы по бухгалтерскому учету в сельском хозяйстве"
    },
    {
        "title": 'Урок 3: Что необходимо знать о себестоимости готовой продукции',
        "url": "https://drive.google.com/file/d/1zNFMnLGU9d5qOdHQLqwlt9x_-wZf63Qw/view?usp=share_link",
        "description": f"Что необходимо знать о себестоимости готовой продукции\n\nРасчет себестоимости продукции сельского хозяйства позволяет фермеру предлагать на рынок товары по конкурентоспособной стоимости. \nПосмотрите видео, где вы узнаете, что лежит в основе формирования себестоимости готовой продукции.\n Особенности распределения затрат, методы расчета определенных типов затрат и особенности калькулирования себестоимости готовой продукции можно узнать на полном курсе «Бухгалтерский учет в сельском хозяйстве».",
        "course_type": "Курсы по бухгалтерскому учету в сельском хозяйстве"
    },
    {
        "title": 'Урок 4: О необходимости ведения учета на предприятии',
        "url": "https://drive.google.com/file/d/12qDe7kTpcWac_QQpMYv3vWxrzJzMP9_S/view?usp=share_link",
        "description": f"О необходимости ведения учета на предприятии\n\nСтатистика, налоги, подотчет, первичка – часто слышите данные термины, но не знаете, что они значат? Посмотрите видео и у вас сложится правильное понимание о важности ведения бухгалтерского учета.\n Также вы можете записаться на полный курс «Бухгалтерский учет в сельском хозяйстве», чтобы на вашем предприятии все было в порядке.",
        "course_type": "Курсы по бухгалтерскому учету в сельском хозяйстве"
    },
    {
        "title": 'Купить полный курс 💵',
        'description': 'Чтобы получить доступ к полному курсу, можете написать Динаре: @dinara_moldagaipova',
        "course_type": "Общий"
    },
    {
        "title": 'Вернуться к выбору курсов ↩️',
        "course_type": "Общий"
    }
]

course_titles = ["Курсы по субсидированию в растениводстве", "Курсы по бухгалтерскому учету в сельском хозяйстве"]