questions_ru = {
    "Q:Какой порядок подписания документов?": "1). Рассмотрение заявки продавцом: Срок рассмотрения неопределен; продавец вправе редактировать вес/количество, дату отгрузки,  упаковку и прочее.\n"
                                            "2). Подписание договора: Сначала подписывает продавец, затем покупатель (Покупателю дается трехдневный срок (3 рабочих дня) для подписания, в случае неоплаты в указанный срок заявка удаляется)."
                                            "3). Оплата заказа: Покупателю для выполнения оплаты дается десятидневный срок (10 рабочих дней)."
                                            "4). Подписание накладных: Как только продавец подписывает со своей стороны, накладная для подписи автоматический переходит к покупателю."
                                            "5). Вложение документов: Продавец  прикладывает ЭСФ (электронная счет фактура) для каждого заказа."
                                            "6). Отправка заявки на субсидию: При заполнении заявки сертификаты, ЭСФ и прочие данные «подтягиваются» автоматический.",
    "Q:Через сколько дней аннулируется договор если не подписать?": "Договор аннулируется после трех дней (3 рабочих дня), с момента перехода на статус «Подписание у покупателя».",
    "Q:Сколько дней дается произвести оплату?": "Для проведения оплаты определен десятидневный срок (10 рабочих дней) с момента перехода на статус «ожидает оплаты».",
    "Q:Как подается заявка на субсидию?": "Заявку на субсидирование можно подать через электронную торговую площадку Qmarket, так и через сам кабинет субсидирования на платформе Qoldau. При формирований заявки посредством сервиса Qmarket данные о продукте (сертификаты, ЭСФ и т.д.) «подтягиваются»автоматический.",
    "Q:Как узнать какой статус заявки?": "Покупатель в своем кабинете может отследить статус заявки и видеть все данные по заказу.",
    "Q:Как долго рассматривает заявку продавец?": "Определенного регламента рассмотрение заявок нет, все решения принимает продавец по своей инициативе. ",
    "Q:Как долго продавец подписывает договор?": "Определенного регламента подписания договора продавцом нет, все решение принимает поставщик по своей инициативе.",
    "Q:Где посмотреть выбранный товар?": "Как только продукт выбирается, выводится уведомление о добавлений товара в корзину, просим пройти по значку корзины в правом верхнем углу.",
    "Q:Как пополнить счет?": "Для этого вам надо войти в личный кабинет, пройти в баланс и нажать кнопку «пополнить»,после чего указать необходимую сумму, далее выбрать вид пополнения через карту (деньги поступают мгновенно) или счет на оплату (деньги поступают в течение рабочего  дня).",
    "Q:Почему исчезает кнопка 50% стоимости при покупки аммиачной селитры?": "График приема заявок продавцом АО «КазАзот» осуществляется ежедневно с 09:00 до 18:00, кроме выходных и праздничных дней.",
    "Q:Когда оплачивать заказ при переводной заявке?": "При переводной заявке оплата производится после одобрения УСХ. При переходе статуса субсидирования на «Заявка у производителя удобрений».",
    "Q:Почему заказы исчезают?": "Если на статусе «Рассмотрение заявки» пропал ваш заказ, значит продавец отклонил вашу заявку, по причине некорректно заполненных данных и т.д.",
    "Q:В течение какого времени можем получить товар? ": "При отправке заявки выбирается желаемая дата отгрузки, согласно указанной дате продавец стремится отправить товар в срок (если указали дату отгрузки/выдачи в день или в ближайшие дни  формирования заявки продавец неспособен выполнить заказ, вероятнее всего отменит заявку) при заполнений заявки убедительно просим уделять внимание на корректность вводимых данных.",
}

questions_kz = {
    "Q:Құжаттарға қол қою тәртібі қандай?": "1). Өтінімді сатушының қарауы: Қарау мерзімі белгісіз; сатушы салмақты/санды, жөнелту күнін, қаптаманы және т.б. өзгертуге құқылы."
                                          "2). Шартқа қол қою: Алдымен сатушы қол қояды, содан кейін сатып алушы (Сатып алушыға қол қоюға үш күндік мерзім (3 жұмыс күні) беріледі, көрсетілген мерзімде төлем жасалмаса, өтінім жойылады)."
                                          "3). Тапсырыс үшін төлем: Сатып алушыға төлемді аяқтау үшін он күндік мерзім (10 жұмыс күні) беріледі."
                                          "4). Жүкқұжатқа қол қою: Сатушы өз тарапынан қол қойғаннан кейін қол қою үшін жүкқұжат автоматты түрде сатып алушыға өтеді."
                                          "5). Құжаттардың қосымшасы: Сатушы әрбір тапсырыс үшін ЭШФ (Электрондық шот-фактура) қосады."
                                          "6). Субсидияға өтінімді жіберу: Өтінімді толтырған кезде сертификаттар, ЭШФ және басқа деректер автоматты түрде «тартылады».",
    "Q:Келісім-шартқа қол қойылмаса неше күннен кейін жойылады?": "Шарт «Сатып алушының қол қоюы» мәртебесіне өткеннен үш күннен кейін (3 жұмыс күні) жойылады.",
    "Q:Төлем жасауға неше күн беріледі?": "Төлеу үшін «төлемді күту» мәртебесіне өткен сәттен бастап он күндік мерзім (10 жұмыс күні) көрсетіледі.",
    "Q:Субсидиялауға қалай өтінім беріледі?": "Субсидиялауға өтінім Qmarket электрондық сауда алаңы арқылы және Qoldau платформасындағы субсидиялау кабинетінің өзі арқылы берілуі мүмкін. Qmarket қызметі арқылы қолданба жасау кезінде өнім деректері (сертификаттар, ЭШФ және т.б.) автоматты түрде «тартылады».",
    "Q:Өтінімнің күйі қандай екенін қалай білуге болады?": "Сатып алушы өз шотындағы қосымшаның күйін бақылап, тапсырыс бойынша барлық деректерді көре алады.",
    "Q:Сатушы өтінімді қанша уақыт ішінде қарайды?": "Өтінімдерді қараудың нақты регламенті жоқ, барлық шешімдерді сатушы өз бастамасымен қабылдайды.",
    "Q:Сатушы келісім-шартқа қанша уақытта қол қояды?": "Сатушының келісім-шартқа қол қоюының нақты регламенті жоқ, барлық шешімдерді жеткізуші өз бастамасымен қабылдайды.",
    "Q:Таңдалған өнімді қайдан көруге болады?": "Өнім таңдалғаннан кейін өнімді себетке қосу туралы хабарландыру көрсетіледі, жоғарғы оң жақ бұрыштағы себет белгішесіне өтіңіз.",
    "Q:Шотты қалай толтыруға болады?": "Ол үшін сіз өзіңіздің жеке кабинетіңізді енгізіп, теңгерімге өтіп, «толтыру» түймесін басуыңыз керек, содан кейін қажетті соманы көрсетіңіз, содан кейін карта (ақша бірден түседі) немесе төлемге арналған шот арқылы толтыру түрін таңдаңыз. (ақша жұмыс күні ішінде түседі).",
    "Q:Аммиак селитрасын сатып алғанда неге 50% құн түймесі жоғалып кетеді?": "АҚ «КазАзот» сатушының өтінімдерді қабылдау кестесі демалыс және мереке күндерін қоспағанда, күн сайын сағат 09:00-ден 18:00-ге дейін жүзеге асырылады.",
    "Q:Өтпелі өтінім бар тапсырысты қашан төлеу керек?": "Өтпелі өтінім үшін төлем ауыл шаруашылығы бөлімі мақұлдағаннан кейін жүзеге асырылады. Субсидиялау мәртебесі «Өтінім тыңайтқыш өндірушіде» өзгерген кезде.",
    "Q:Неліктен тапсырыстар жоғалып кетеді?": "Егер сіздің тапсырысыңыз «Өтінімді қарау» күйінде жоғалып кетсе, сатушы дұрыс толтырылмаған деректерге байланысты өтініміңізді қабылдамады.",
    "Q:Біз тауарды қанша уақытта аламыз?": "Өтінімді қалыптастыру кезінде жөнелтудің қалаған күні таңдалады, көрсетілген күнге сәйкес сатушы тауарды уақытында жіберуге тырысады (егер жөнелту/жеткізу күні өтінім  қалыптастыру күні немесе келесі жақын арадағы күндері көрсетілген болса), сатушы тапсырысты орындай алмайды, өтінім жоюлы мүмкін) өтінімді толтырған кезде енгізілген деректердің дұрыстығына назар аударуыңызды сұраймыз. ",
}


available_options_ru = ["Узнать колл центр продавцов", "Ответы на часто задаваемые вопросы", "Посмотреть обучающие видео", "Узнать колл центр Qmarketa"]
available_options_kz = ["Сатушылардың байланыс орталықтарын біліңіз", "Жиі қойылатын сұрақтарға жауаптар", "Нұсқаулық бейнелерді қараңыз", "Qmarketa байланыс орталығын табыңыз"]